import React, {useState} from 'react';
import {useDropzone} from "react-dropzone";
import '../../../styles/insuranceModalBlock.css'

const InsuranceModalBlock = () => {
    const [files, setFiles] = useState([]);
    const { getRootProps, getInputProps } = useDropzone({
        onDrop: acceptedFiles => {
            if (files.length + acceptedFiles.length <= 5) {
                setFiles([...files, ...acceptedFiles]);
            } else {
                alert('You can only upload up to 5 files.');
            }
        }
    });

    const handleDelete = (filePath) => {
        setFiles(files.filter(file => file.path !== filePath));
    };

    const fileItems = files.map(file => (
        <li key={file.path} className='file-item'>
            <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36" viewBox="0 0 36 36" fill="none">
                <path
                    d="M4.5 15C4.5 9.3435 4.5 6.5145 6.258 4.758C8.0145 3 10.8435 3 16.5 3H19.5C25.1565 3 27.9855 3 29.742 4.758C31.5 6.5145 31.5 9.3435 31.5 15V21C31.5 26.6565 31.5 29.4855 29.742 31.242C27.9855 33 25.1565 33 19.5 33H16.5C10.8435 33 8.0145 33 6.258 31.242C4.5 29.4855 4.5 26.6565 4.5 21V15Z"
                    stroke="#333333" strokeWidth="2.25" />
                <path d="M12 15H24M12 21H19.5" stroke="#333333" strokeWidth="2.25" strokeLinecap="round" />
            </svg>
            <span>{file.path}</span>
            <button className="delete-btn" onClick={() => handleDelete(file.path)}>
                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                    <path fillRule="evenodd" clipRule="evenodd"
                          d="M1.33325 4.00016C1.33325 3.63197 1.63173 3.3335 1.99992 3.3335H13.9999C14.3681 3.3335 14.6666 3.63197 14.6666 4.00016C14.6666 4.36835 14.3681 4.66683 13.9999 4.66683H1.99992C1.63173 4.66683 1.33325 4.36835 1.33325 4.00016Z"
                          fill="#EA2119" />
                    <path fillRule="evenodd" clipRule="evenodd"
                          d="M6.66675 1.99984C6.48994 1.99984 6.32037 2.07007 6.19534 2.1951C6.07032 2.32012 6.00008 2.48969 6.00008 2.6665V3.99984C6.00008 4.36803 5.7016 4.6665 5.33341 4.6665C4.96522 4.6665 4.66675 4.36803 4.66675 3.99984V2.6665C4.66675 2.13607 4.87746 1.62736 5.25253 1.25229C5.62761 0.877218 6.13631 0.666504 6.66675 0.666504H9.33341C9.86385 0.666504 10.3726 0.877218 10.7476 1.25229C11.1227 1.62736 11.3334 2.13607 11.3334 2.6665V3.99984C11.3334 4.36803 11.0349 4.6665 10.6667 4.6665C10.2986 4.6665 10.0001 4.36803 10.0001 3.99984V2.6665C10.0001 2.48969 9.92984 2.32012 9.80482 2.1951C9.67979 2.07007 9.51023 1.99984 9.33341 1.99984H6.66675ZM3.33341 3.33317C3.7016 3.33317 4.00008 3.63165 4.00008 3.99984V13.3332C4.00008 13.51 4.07032 13.6795 4.19534 13.8046C4.32037 13.9296 4.48994 13.9998 4.66675 13.9998H11.3334C11.5102 13.9998 11.6798 13.9296 11.8048 13.8046C11.9298 13.6795 12.0001 13.51 12.0001 13.3332V3.99984C12.0001 3.63165 12.2986 3.33317 12.6667 3.33317C13.0349 3.33317 13.3334 3.63165 13.3334 3.99984V13.3332C13.3334 13.8636 13.1227 14.3723 12.7476 14.7474C12.3726 15.1225 11.8638 15.3332 11.3334 15.3332H4.66675C4.13631 15.3332 3.62761 15.1225 3.25253 14.7474C2.87746 14.3723 2.66675 13.8636 2.66675 13.3332V3.99984C2.66675 3.63165 2.96522 3.33317 3.33341 3.33317Z"
                          fill="#EA2119" />
                </svg>
            </button>
        </li>
    ));

    return (
        <div className='insurance-modal-block'>
            <p>Заявление о страховом случае</p>
            <div className="dropzone-container">
                <div {...getRootProps({className: 'application-dropzone'})}>
                    <input {...getInputProps()} />
                    <div className='label'>
                        <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M10.1287 9.49979V16.2428C10.1365 16.7358 10.3378 17.2061 10.6893 17.552C11.0407 17.8979 11.5141 18.0918 12.0072 18.0918C12.5004 18.0918 12.9737 17.8979 13.3252 17.552C13.6766 17.2061 13.878 16.7358 13.8857 16.2428L13.8918 7.40448C13.8969 6.98304 13.8184 6.56477 13.6606 6.17393C13.5029 5.7831 13.2691 5.42745 12.9729 5.12763C12.6767 4.8278 12.3239 4.58975 11.935 4.42728C11.5461 4.26481 11.1289 4.18115 10.7074 4.18115C10.2859 4.18115 9.86863 4.26481 9.47974 4.42728C9.09084 4.58975 8.73806 4.8278 8.44185 5.12763C8.14564 5.42745 7.91189 5.7831 7.75415 6.17393C7.59641 6.56477 7.51782 6.98304 7.52293 7.40448V16.3023C7.51434 16.8956 7.62379 17.4847 7.8449 18.0354C8.06602 18.586 8.39439 19.0872 8.81093 19.5098C9.22747 19.9324 9.72386 20.268 10.2713 20.4971C10.8186 20.7261 11.4061 20.8441 11.9995 20.8441C12.5929 20.8441 13.1803 20.7261 13.7277 20.4971C14.2751 20.268 14.7715 19.9324 15.1881 19.5098C15.6046 19.0872 15.933 18.586 16.1541 18.0354C16.3752 17.4847 16.4846 16.8956 16.4761 16.3023V7.9876"
                                stroke="#959595" strokeOpacity="0.4" strokeWidth="1.5" strokeMiterlimit="10"
                                strokeLinecap="round"/>
                        </svg>
                        <span>Выберите документы<br/>
                            или перетащите сюда</span>
                    </div>

                </div>
                <span className='info'>Загрузите необходимые документы (необязательно)</span>
                <ul className='files-list'>{fileItems}</ul>
            </div>
            <div className="info-container">
                <p>Перечень документов для подачи заявления о страховом случае</p>
                <ul>
                    <li>Договор обязательного страхования гражданской ответсвенности владельцев транспортных средств
                    </li>
                    <li>Догвор добровольного страхования - КАСКО(необязательно)</li>
                    <li>Технический паспорт на транспортное средство</li>
                    <li>Водительское удостоверение</li>
                    <li>Паспорт владельца транспортного средства</li>
                    <li>Фото справки либо талона из компетентных органов (при условии обращения)</li>
                    <li>Европротокол (в случае заполнения)</li>
                    <li>Фото повреждений</li>
                    <li>Для юридических лиц: доверенность от организации на право подписи (если приедет директор -
                        приказ о назначении)
                    </li>
                    <li>Для индивидуальных предпринимателей: свидетельство о гос.регистрации</li>
                </ul>
                <button>Отправить заявление</button>
            </div>
            <div className="success">
                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                    <path fillRule="evenodd" clipRule="evenodd"
                          d="M10.442 2.51561C9.26012 1.98901 7.93972 1.85856 6.67767 2.1437C5.41563 2.42884 4.27957 3.1143 3.43893 4.09785C2.59828 5.08141 2.0981 6.31035 2.01297 7.6014C1.92783 8.89245 2.26232 10.1764 2.96654 11.2619C3.67075 12.3473 4.70697 13.176 5.92064 13.6244C7.13432 14.0728 8.46042 14.1168 9.70118 13.75C10.9419 13.3831 12.0309 12.625 12.8056 11.5887C13.5803 10.5524 13.9992 9.29346 14 7.99961V7.38666C14 7.01847 14.2984 6.71999 14.6666 6.71999C15.0348 6.71999 15.3333 7.01847 15.3333 7.38666V7.99999C15.3324 9.58137 14.8203 11.1205 13.8735 12.387C12.9266 13.6536 11.5957 14.5802 10.0792 15.0286C8.56274 15.4769 6.94195 15.4231 5.45857 14.8751C3.97519 14.327 2.70871 13.3142 1.848 11.9876C0.987288 10.6609 0.578473 9.09162 0.682522 7.51367C0.786572 5.93572 1.39791 4.43368 2.42536 3.23156C3.45282 2.02944 4.84134 1.19165 6.38383 0.843146C7.92633 0.49464 9.54016 0.654086 10.9846 1.29771C11.3209 1.44756 11.4721 1.84168 11.3222 2.17799C11.1724 2.51431 10.7783 2.66546 10.442 2.51561Z"
                          fill="#30D158"/>
                    <path fillRule="evenodd" clipRule="evenodd"
                          d="M15.1379 2.19503C15.3984 2.45525 15.3986 2.87736 15.1383 3.13784L8.47168 9.81117C8.34668 9.9363 8.17708 10.0066 8.00021 10.0067C7.82334 10.0067 7.6537 9.93647 7.52864 9.8114L5.52864 7.8114C5.26829 7.55106 5.26829 7.12895 5.52864 6.8686C5.78899 6.60825 6.2111 6.60825 6.47145 6.8686L7.9998 8.39696L14.1951 2.1955C14.4553 1.93502 14.8774 1.93481 15.1379 2.19503Z"
                          fill="#30D158"/>
                </svg>
                <span>Запрос отправлен</span>
            </div>
        </div>
    );
};

export default InsuranceModalBlock;