import React from 'react';

const ProfileNotification = () => {
    const hideNotifications = () => {
        document.querySelector('.profile-notification-container').classList.remove('open');
    }
    return (
        <div className='profile-notification-container'>
            <div className="back-btn" onClick={() => hideNotifications()}>
                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="17" viewBox="0 0 16 17" fill="none">
                    <path fillRule="evenodd" clipRule="evenodd"
                          d="M2.66663 8.49967C2.66663 8.13148 2.9651 7.83301 3.33329 7.83301H12.6666C13.0348 7.83301 13.3333 8.13148 13.3333 8.49967C13.3333 8.86786 13.0348 9.16634 12.6666 9.16634H3.33329C2.9651 9.16634 2.66663 8.86786 2.66663 8.49967Z"
                          fill="#0070C9"/>
                    <path fillRule="evenodd" clipRule="evenodd"
                          d="M8.47136 3.36225C8.73171 3.6226 8.73171 4.04471 8.47136 4.30506L4.2761 8.50033L8.47136 12.6956C8.73171 12.9559 8.73171 13.378 8.47136 13.6384C8.21101 13.8987 7.7889 13.8987 7.52855 13.6384L2.86189 8.97173C2.60154 8.71138 2.60154 8.28927 2.86189 8.02892L7.52855 3.36225C7.7889 3.1019 8.21101 3.1019 8.47136 3.36225Z"
                          fill="#0070C9"/>
                </svg>
                <span>Назад</span>
            </div>
            <h2>Мои уведомления</h2>
            <ul className="notification-list">
                <li>
                    <span>Необходимо произвести оплату по договору ФЛ000000</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M8.29289 5.29289C8.68342 4.90237 9.31658 4.90237 9.70711 5.29289L15.7071 11.2929C16.0976 11.6834 16.0976 12.3166 15.7071 12.7071L9.70711 18.7071C9.31658 19.0976 8.68342 19.0976 8.29289 18.7071C7.90237 18.3166 7.90237 17.6834 8.29289 17.2929L13.5858 12L8.29289 6.70711C7.90237 6.31658 7.90237 5.68342 8.29289 5.29289Z"
                              fill="#333333" fillOpacity="0.4"/>
                    </svg>
                </li>
                <li>
                    <span>Вам одобрили заявку на лизинг</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M8.29289 5.29289C8.68342 4.90237 9.31658 4.90237 9.70711 5.29289L15.7071 11.2929C16.0976 11.6834 16.0976 12.3166 15.7071 12.7071L9.70711 18.7071C9.31658 19.0976 8.68342 19.0976 8.29289 18.7071C7.90237 18.3166 7.90237 17.6834 8.29289 17.2929L13.5858 12L8.29289 6.70711C7.90237 6.31658 7.90237 5.68342 8.29289 5.29289Z"
                              fill="#333333" fillOpacity="0.4"/>
                    </svg>
                </li>
                <li>
                    <span>Вы просрочили платеж по договору ФЛ0000</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M8.29289 5.29289C8.68342 4.90237 9.31658 4.90237 9.70711 5.29289L15.7071 11.2929C16.0976 11.6834 16.0976 12.3166 15.7071 12.7071L9.70711 18.7071C9.31658 19.0976 8.68342 19.0976 8.29289 18.7071C7.90237 18.3166 7.90237 17.6834 8.29289 17.2929L13.5858 12L8.29289 6.70711C7.90237 6.31658 7.90237 5.68342 8.29289 5.29289Z"
                              fill="#333333" fillOpacity="0.4"/>
                    </svg>
                </li>
                <li>
                    <span>Вы просрочили платеж по договору ФЛ0000</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M8.29289 5.29289C8.68342 4.90237 9.31658 4.90237 9.70711 5.29289L15.7071 11.2929C16.0976 11.6834 16.0976 12.3166 15.7071 12.7071L9.70711 18.7071C9.31658 19.0976 8.68342 19.0976 8.29289 18.7071C7.90237 18.3166 7.90237 17.6834 8.29289 17.2929L13.5858 12L8.29289 6.70711C7.90237 6.31658 7.90237 5.68342 8.29289 5.29289Z"
                              fill="#333333" fillOpacity="0.4"/>
                    </svg>
                </li>

            </ul>
        </div>
    );
};

export default ProfileNotification;