import React, {useState} from 'react';
import {Select} from "@chakra-ui/react";
import {ChevronDownIcon} from "@chakra-ui/icons";
import DocumentCopyItem from "./DocumentCopyItem.jsx";

const DocumentCopyModalBlock = () => {
    const [count , setCount ] =  useState(1);
    const [open , setOpen] = useState(false)
    return (
        <div className='document-copy-modal-block'>
            <div className="block1">
                <div className="title-block">
                    <div className="title-container">
                        <p>Копии документов</p>
                        <span>Выберите необходимые документы и добавьте их в корзину</span>
                    </div>
                    <div className="count" onClick={() => setOpen(true)}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="13" height="16" viewBox="0 0 13 16" fill="none">
                            <rect x="0.75" y="4.75" width="11.5" height="10.5" rx="1.25" stroke="black"
                                  strokeWidth="1.5"/>
                            <path d="M9.5 4.49999C9.5 0.500003 3.5 0.5 3.5 4.49999" stroke="black" strokeWidth="1.5"/>
                        </svg>
                        <span className="counter">
                            {count}
                        </span>
                    </div>
                </div>
                <div className="filter">
                    <Select className='document-container-select'
                            icon={<ChevronDownIcon/>}
                            width='100%'
                    >
                        <option value='option1'>Предмет лизинга</option>
                        <option value='option2'>Предмет лизинга 2</option>
                        <option value='option3'>Предмет лизинга 3</option>
                    </Select>
                    <Select className='document-container-select'
                            icon={<ChevronDownIcon/>}
                            width='100%'
                    >
                        <option value='option1'>Апрель 2020</option>
                        <option value='option2'>Апрель 2021</option>
                        <option value='option3'>Апрель 2022</option>
                    </Select>
                </div>
                <div className="documents-list">
                    <DocumentCopyItem/>
                    <DocumentCopyItem/>
                    <DocumentCopyItem/>
                    <DocumentCopyItem/>
                    <DocumentCopyItem/>
                    <DocumentCopyItem/>
                    <DocumentCopyItem/>
                    <DocumentCopyItem/>
                </div>
                <div className={open ? "choosen-documents open" : "choosen-documents"}>
                    <div className="back-btn" onClick={() => setOpen(false)}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="17" viewBox="0 0 16 17" fill="none">
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M2.6665 8.49967C2.6665 8.13148 2.96498 7.83301 3.33317 7.83301H12.6665C13.0347 7.83301 13.3332 8.13148 13.3332 8.49967C13.3332 8.86786 13.0347 9.16634 12.6665 9.16634H3.33317C2.96498 9.16634 2.6665 8.86786 2.6665 8.49967Z"
                                  fill="#0070C9"/>
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M8.47124 3.36225C8.73159 3.6226 8.73159 4.04471 8.47124 4.30506L4.27598 8.50033L8.47124 12.6956C8.73159 12.9559 8.73159 13.378 8.47124 13.6384C8.21089 13.8987 7.78878 13.8987 7.52843 13.6384L2.86177 8.97173C2.60142 8.71138 2.60142 8.28927 2.86177 8.02892L7.52843 3.36225C7.78878 3.1019 8.21089 3.1019 8.47124 3.36225Z"
                                  fill="#0070C9"/>
                        </svg>
                        <span>К списку документов</span>
                    </div>
                    <p className='title'>Список выбранных документов для копий</p>
                    <div className="documents-list">
                        <div className="document-item">
                            <div className="watch">
                                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16"
                                     fill="none">
                                    <path fillRule="evenodd" clipRule="evenodd"
                                          d="M1.42716 8C1.50002 8.12591 1.59662 8.28637 1.71628 8.47165C2.02362 8.94754 2.47878 9.5804 3.06969 10.2107C4.26368 11.4843 5.933 12.6667 8 12.6667C10.067 12.6667 11.7363 11.4843 12.9303 10.2107C13.5212 9.5804 13.9764 8.94754 14.2837 8.47165C14.4034 8.28637 14.5 8.12591 14.5728 8C14.5 7.87409 14.4034 7.71363 14.2837 7.52835C13.9764 7.05246 13.5212 6.4196 12.9303 5.78929C11.7363 4.51571 10.067 3.33333 8 3.33333C5.933 3.33333 4.26368 4.51571 3.06969 5.78929C2.47878 6.4196 2.02362 7.05246 1.71628 7.52835C1.59662 7.71363 1.50002 7.87409 1.42716 8ZM15.3333 8C15.9296 7.70186 15.9295 7.70163 15.9294 7.70139L15.9283 7.69925L15.926 7.69469L15.9184 7.67988C15.9121 7.66752 15.9031 7.65021 15.8915 7.62829C15.8683 7.58447 15.8347 7.52215 15.7907 7.44399C15.7028 7.28776 15.5734 7.06768 15.4038 6.80498C15.0653 6.28088 14.5621 5.5804 13.903 4.87737C12.597 3.48429 10.5997 2 8 2C5.40033 2 3.40299 3.48429 2.09698 4.87737C1.43789 5.5804 0.93471 6.28088 0.596224 6.80498C0.426567 7.06768 0.297195 7.28776 0.209314 7.44399C0.165349 7.52215 0.131693 7.58447 0.108502 7.62829C0.0969045 7.65021 0.0879168 7.66752 0.0815586 7.67988L0.0739933 7.69469L0.0716926 7.69925L0.0709134 7.7008C0.0707909 7.70104 0.0703819 7.70186 0.666667 8L0.0703819 7.70186C-0.0234606 7.88954 -0.0234606 8.11046 0.0703819 8.29814L0.666667 8C0.0703819 8.29814 0.0702594 8.2979 0.0703819 8.29814L0.0716926 8.30075L0.0739933 8.30531L0.0815586 8.32012C0.0879168 8.33248 0.0969045 8.34979 0.108502 8.37171C0.131693 8.41553 0.165349 8.47785 0.209314 8.55601C0.297195 8.71224 0.426567 8.93232 0.596224 9.19502C0.93471 9.71913 1.43789 10.4196 2.09698 11.1226C3.40299 12.5157 5.40033 14 8 14C10.5997 14 12.597 12.5157 13.903 11.1226C14.5621 10.4196 15.0653 9.71913 15.4038 9.19502C15.5734 8.93232 15.7028 8.71224 15.7907 8.55601C15.8347 8.47785 15.8683 8.41553 15.8915 8.37171C15.9031 8.34979 15.9121 8.33248 15.9184 8.32012L15.926 8.30531L15.9283 8.30075L15.9291 8.2992C15.9292 8.29896 15.9296 8.29814 15.3333 8ZM15.3333 8L15.9296 8.29814C16.0235 8.11046 16.0232 7.88907 15.9294 7.70139L15.3333 8Z"
                                          fill="#333333"/>
                                    <path fillRule="evenodd" clipRule="evenodd"
                                          d="M8.00016 6.66634C7.26378 6.66634 6.66683 7.26329 6.66683 7.99967C6.66683 8.73605 7.26378 9.33301 8.00016 9.33301C8.73654 9.33301 9.3335 8.73605 9.3335 7.99967C9.3335 7.26329 8.73654 6.66634 8.00016 6.66634ZM5.3335 7.99967C5.3335 6.52692 6.5274 5.33301 8.00016 5.33301C9.47292 5.33301 10.6668 6.52692 10.6668 7.99967C10.6668 9.47243 9.47292 10.6663 8.00016 10.6663C6.5274 10.6663 5.3335 9.47243 5.3335 7.99967Z"
                                          fill="#333333"/>
                                </svg>
                            </div>
                            <span>Доверенность на регистрацию предмета лизинга от 11.01.2020</span>
                            <div className="delete">
                                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16"
                                     fill="none">
                                    <path fillRule="evenodd" clipRule="evenodd"
                                          d="M1.3335 3.99967C1.3335 3.63148 1.63197 3.33301 2.00016 3.33301H14.0002C14.3684 3.33301 14.6668 3.63148 14.6668 3.99967C14.6668 4.36786 14.3684 4.66634 14.0002 4.66634H2.00016C1.63197 4.66634 1.3335 4.36786 1.3335 3.99967Z"
                                          fill="#EA2119"/>
                                    <path fillRule="evenodd" clipRule="evenodd"
                                          d="M6.6665 2.00033C6.48969 2.00033 6.32012 2.07056 6.1951 2.19559C6.07007 2.32061 5.99984 2.49018 5.99984 2.66699V4.00033C5.99984 4.36852 5.70136 4.66699 5.33317 4.66699C4.96498 4.66699 4.6665 4.36852 4.6665 4.00033V2.66699C4.6665 2.13656 4.87722 1.62785 5.25229 1.25278C5.62736 0.877706 6.13607 0.666992 6.6665 0.666992H9.33317C9.8636 0.666992 10.3723 0.877706 10.7474 1.25278C11.1225 1.62785 11.3332 2.13656 11.3332 2.66699V4.00033C11.3332 4.36852 11.0347 4.66699 10.6665 4.66699C10.2983 4.66699 9.99984 4.36852 9.99984 4.00033V2.66699C9.99984 2.49018 9.9296 2.32061 9.80457 2.19559C9.67955 2.07056 9.50998 2.00033 9.33317 2.00033H6.6665ZM3.33317 3.33366C3.70136 3.33366 3.99984 3.63214 3.99984 4.00033V13.3337C3.99984 13.5105 4.07007 13.68 4.1951 13.8051C4.32012 13.9301 4.48969 14.0003 4.6665 14.0003H11.3332C11.51 14.0003 11.6795 13.9301 11.8046 13.8051C11.9296 13.68 11.9998 13.5105 11.9998 13.3337V4.00033C11.9998 3.63214 12.2983 3.33366 12.6665 3.33366C13.0347 3.33366 13.3332 3.63214 13.3332 4.00033V13.3337C13.3332 13.8641 13.1225 14.3728 12.7474 14.7479C12.3723 15.1229 11.8636 15.3337 11.3332 15.3337H4.6665C4.13607 15.3337 3.62736 15.1229 3.25229 14.7479C2.87722 14.3728 2.6665 13.8641 2.6665 13.3337V4.00033C2.6665 3.63214 2.96498 3.33366 3.33317 3.33366Z"
                                          fill="#EA2119"/>
                                </svg>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <div className="block2">
                <span>Статус оплаты изменится по факту поступления средств на наш счет.
Примерное время поступления средств: 24 часа.</span>
                <div className="price-row">
                    <p>Сумма к оплате: </p>
                    <p>12 руб</p>
                </div>
                <button>Перейти к оплате</button>
            </div>
        </div>
    );
};

export default DocumentCopyModalBlock;